"use client";
import Nav from "@/components/home-components/nav";
import InfoCard from "./components/info-card";
import React, { useState } from "react";
import InfoBtn from "@/app/courses/[courseName]/components/info-btn";
import Topics from "./components/topics";
import Teacher from "./components/teacher";
import InfoParagraphs from "./components/info-paragraphs";
import MainComponent from "./components/mobile-components/main-component";
import Footer from "@/components/home-components/Footer/Footer";
const CourseInfo = ({ params }: { params: { courseName: string } }) => {
  const [expand, setExpand] = useState(false);
  return (
    <div>
      <div className="grid grid-cols-1 gap-[3%]">
        <Nav />
        <div dir="rtl" className="font-YekanBakh w-[90%] mx-auto">
          {params.courseName === "front-end" && (
            <React.Fragment>
              <div className="lg:grid lg:grid-cols-1 hidden">
                <InfoCard
                  title="دوره جامع فرانت اِند"
                  textInfo="صفحه اصلی هر وبسایت و هر چیز بصری است که کاربر با آن در تماس است. همه قسمت هایی است که کاربران مستقیماً با آنها ارتباط برقرار می کنند، همه محتوا و استایلها ، دکمه ها و جلوه های مختلف قبل از اینکه کاربر روی پیوند کلیک کند، فرم های تماس با فیلدهای ورودی مختلف، کادرهای جستجو و منوهای کشویی است. طرح بندی ها، متن و رنگ ها. تصاویر و فیلم ها هستند. ولی فرانت اند ، فقط مربوط به استایلها نیست."
                  imgSrc="/courses/frontendstack1.svg"
                />
                <InfoParagraphs
                  info={[
                    {
                      title: "چرا Frontend مهم است؟",
                      text: `
                          شرکت یا سازمانی با سایتی که استفاده و گشت و گذار در آن دشوار است
                          و ظاهر خوبی ندارد و خدمات خود را به زیبایی ارائه نمی دهد،
                          مشتریان و مشتریان خود را از دست می دهد.کاربران به دلیل عدم
                          قابلیت استفاده، تجربه کاربری ناخوشایند و عدم طراحی خوب، ناامید
                          خواهند شد. آنها در نهایت به جستجوی جایی دیگر برای آنچه که به
                          دنبال آن بودند می پردازند و به احتمال زیاد دیگر به آن سایت باز
                          نخواهند گشت.`,
                    },
                    {
                      title: "آیا Frontend برای شما مناسب است؟ ",
                      text: `توسعه Frontend یک تلاش خلاقانه و هنری است. ترکیبی از هنرهای تجسمی و برنامه نویسی است. یک راه برای تصمیم گیری در مورد اینکه آیا توسعه frontend برای شما مناسب است یا خیر این است که در نظر بگیرید که آیا از دیدن نتایج بصری کار سخت خود لذت می برید یا خیر. این امکان وجود دارد که نتایج کار خود را فوراً بر روی صفحه نمایش رایانه خود مشاهده کنید. نکته دیگری که باید در نظر بگیرید این است که آیا شما عمیقاً به کاربرانی که بهترین تجربه کاربری ممکن را هنگام مرور وب داشته باشند اهمیت می دهید یا خیر. تجربه کاربری و ایجاد وب سایت های قابل استفاده بخش بزرگی از کار است. تنها راه برای فهمیدن اینکه آیا توسعه frontend مسیر درستی برای شماست یا خیر این است که در این مسیر قدم بردارید. یک مکان عالی برای شروع یادگیری شما با کلاس های کیکاووس زمان است که با ساختن 20 پروژه یاد خواهید گرفت و در پایان گواهینامه دریافت خواهید کرد.`,
                    },
                  ]}
                  expand={expand}
                />
                <div>
                  {/* button */}
                  <InfoBtn
                    text={expand ? "بستن مطالب" : "ادامه مطالب"}
                    setExpand={setExpand}
                    expand={expand}
                  />
                  {/* Topics */}
                  <Topics
                    topics={{
                      line1: [
                        "HTML & CSS",
                        "Sass",
                        "Tailwind",
                        "React JS",
                        "Next JS",
                      ],
                    }}
                  />
                  {/* teacher */}
                  <Teacher />
                </div>
              </div>
              <div className="lg:hidden grid grid-cols-1">
                <MainComponent
                  info={[
                    {
                      title: "چرا Frontend مهم است؟",
                      text: `
                          شرکت یا سازمانی با سایتی که استفاده و گشت و گذار در آن دشوار است
                          و ظاهر خوبی ندارد و خدمات خود را به زیبایی ارائه نمی دهد،
                          مشتریان و مشتریان خود را از دست می دهد.کاربران به دلیل عدم
                          قابلیت استفاده، تجربه کاربری ناخوشایند و عدم طراحی خوب، ناامید
                          خواهند شد. آنها در نهایت به جستجوی جایی دیگر برای آنچه که به
                          دنبال آن بودند می پردازند و به احتمال زیاد دیگر به آن سایت باز
                          نخواهند گشت.`,
                    },
                    {
                      title: "آیا Frontend برای شما مناسب است؟ ",
                      text: "توسعه Frontend یک تلاش خلاقانه و هنری است. ترکیبی از هنرهای تجسمی و برنامه نویسی است. یک راه برای تصمیم گیری در مورد اینکه آیا توسعه frontend برای شما مناسب است یا خیر این است که در نظر بگیرید که آیا از دیدن نتایج بصری کار سخت خود لذت می برید یا خیر. این امکان وجود دارد که نتایج کار خود را فوراً بر روی صفحه نمایش رایانه خود مشاهده کنید. نکته دیگری که باید در نظر بگیرید این است که آیا شما عمیقاً به کاربرانی که بهترین تجربه کاربری ممکن را هنگام مرور وب داشته باشند اهمیت می دهید یا خیر. تجربه کاربری و ایجاد وب سایت های قابل استفاده بخش بزرگی از کار است. تنها راه برای فهمیدن اینکه آیا توسعه frontend مسیر درستی برای شماست یا خیر این است که در این مسیر قدم بردارید. یک مکان عالی برای شروع یادگیری شما با کلاس های کیکاووس زمان است که با ساختن 20 پروژه یاد خواهید گرفت و در پایان گواهینامه دریافت خواهید کرد.",
                    },
                  ]}
                  expand={expand}
                  setExpand={setExpand}
                  text={expand ? "بستن مطالب" : "ادامه مطالب"}
                  title="دوره جامع فرانت اِند"
                  textInfo="صفحه اصلی هر وبسایت و هر چیز بصری است که کاربر با آن در تماس است. همه قسمت هایی است که کاربران مستقیماً با آنها ارتباط برقرار می کنند، همه محتوا و استایلها ، دکمه ها و جلوه های مختلف قبل از اینکه کاربر روی پیوند کلیک کند، فرم های تماس با فیلدهای ورودی مختلف، کادرهای جستجو و منوهای کشویی است. طرح بندی ها، متن و رنگ ها. تصاویر و فیلم ها هستند. ولی فرانت اند ، فقط مربوط به استایلها نیست."
                  imgSrc="/courses/frontendstack1.svg"
                  topics={{
                    line1: [
                      "HTML & CSS",
                      "Sass",
                      "Tailwind",
                      "React JS",
                      "Next JS",
                    ],
                  }}
                />
              </div>
            </React.Fragment>
          )}

          {params.courseName === "back-end" && (
            <div>
              <div className="lg:grid lg:grid-cols-1 hidden">
                <InfoCard
                  title="دوره جامع بک اِند"
                  textInfo="توسعه Backend با فناوری هایی که مسئول ذخیره و تغییر ایمن داده های کاربر هستند، سر وکار دارد. بخشی است که به تمام منطق پنهان مرتبط است که به برنامه هایی که کاربران با آن تعامل دارند، قدرت می دهد.
              Backend به عنوان بخش سمت سرور یک برنامه در نظر گرفته می شود.
              Backend تمام کارهای درونی پنها  در زیر کاپوت می گذرد و تمام اجزای لازم که باعث می شود قسمت جلویی به درستی و روان عمل کند، اشاره دارد.."
                  imgSrc="/courses/nodejs2.svg"
                />
                <div>
                  {/* texts */}
                  <InfoParagraphs
                    info={[
                      {
                        title: "مروری بر نحوه عملکرد Backend برای مبتدیان",
                        text: `
                مسئول دریافت درخواست‌های مشتری است.درخواست دریافتی را پردازش می
                کند و مطمئن می شود که داده های مناسب مرتبط با کاربر صحیح را
                استخراج می کند. سپس، پاسخی را برای مشتری ارسال می کند. داده‌های
                کاربر به‌صورت بصری، با کد ظاهری ایجاد شده توسط توسعه‌دهنده
                فرانت‌اند، به کاربر مناسبی که به آن دسترسی دارد، ارائه
                می‌شود.Backend شامل موارد زیر است:`,
                      },
                      {
                        title: "سرور",
                        text: `
                    برنامه ای است که منتظر درخواست های دریافتی از مشتری است. با
                    ارسال کوئری های پایگاه داده با پایگاه داده ارتباط برقرار می کند.
                    هنگامی که پایگاه داده با اطلاعات پاسخ می دهد، سرور داده های صحیح
                    لازم را استخراج می کند. این امر با کمک برنامه ای که روی سرور
                    اجرا می شود و حاوی منطق لازم است که اطلاعات و منابع درخواستی را
                    برای کاربر مناسب جمع آوری می کند، به دست می آید. اسکریپت های سمت
                    سرور Backend، که در یک زبان برنامه نویسی Backend نوشته شده اند،
                    مسئول پردازش درخواست ها هستند. در نهایت، سرور پاسخی را به مشتری
                    ارسال می کند.`,
                      },
                      {
                        title: "پایگاه داده",
                        text: `مانند 'مغز' یک برنامه کاربردی است. پایگاه های داده برنامه
                    هایی هستند که برای سازماندهی و ذخیره تمامی دارایی ها، محتوا و
                    اطلاعات یک برنامه کاربردی به گونه ای که به راحتی قابل دسترسی و
                    بازیابی، مدیریت و به روز رسانی باشد، استفاده می شوند.`,
                      },
                    ]}
                    expand={expand}
                  />
                  {/* button */}
                  <InfoBtn
                    text={expand ? "بستن مطالب" : "ادامه مطالب"}
                    setExpand={setExpand}
                    expand={expand}
                  />
                  {/* Topics */}
                  <Topics
                    topics={{
                      line1: [
                        "HTML & CSS",
                        "JS",
                        "Node JS",
                        "Express",
                        "Mongodb",
                      ],
                    }}
                  />
                  {/* teacher */}
                  <Teacher />
                </div>
              </div>
              <div className="lg:hidden grid grid-cols-1">
                <MainComponent
                  title="دوره جامع بک اِند"
                  textInfo="توسعه Backend با فناوری هایی که مسئول ذخیره و تغییر ایمن داده های کاربر هستند، سر وکار دارد. بخشی است که به تمام منطق پنهان مرتبط است که به برنامه هایی که کاربران با آن تعامل دارند، قدرت می دهد.
            Backend به عنوان بخش سمت سرور یک برنامه در نظر گرفته می شود.
            Backend تمام کارهای درونی پنها  در زیر کاپوت می گذرد و تمام اجزای لازم که باعث می شود قسمت جلویی به درستی و روان عمل کند، اشاره دارد.."
                  imgSrc="/courses/nodejs2.svg"
                  info={[
                    {
                      title: "مروری بر نحوه عملکرد Backend برای مبتدیان",
                      text: `
              مسئول دریافت درخواست‌های مشتری است.درخواست دریافتی را پردازش می
              کند و مطمئن می شود که داده های مناسب مرتبط با کاربر صحیح را
              استخراج می کند. سپس، پاسخی را برای مشتری ارسال می کند. داده‌های
              کاربر به‌صورت بصری، با کد ظاهری ایجاد شده توسط توسعه‌دهنده
              فرانت‌اند، به کاربر مناسبی که به آن دسترسی دارد، ارائه
              می‌شود.Backend شامل موارد زیر است:`,
                    },
                    {
                      title: "سرور",
                      text: `
                  برنامه ای است که منتظر درخواست های دریافتی از مشتری است. با
                  ارسال کوئری های پایگاه داده با پایگاه داده ارتباط برقرار می کند.
                  هنگامی که پایگاه داده با اطلاعات پاسخ می دهد، سرور داده های صحیح
                  لازم را استخراج می کند. این امر با کمک برنامه ای که روی سرور
                  اجرا می شود و حاوی منطق لازم است که اطلاعات و منابع درخواستی را
                  برای کاربر مناسب جمع آوری می کند، به دست می آید. اسکریپت های سمت
                  سرور Backend، که در یک زبان برنامه نویسی Backend نوشته شده اند،
                  مسئول پردازش درخواست ها هستند. در نهایت، سرور پاسخی را به مشتری
                  ارسال می کند.`,
                    },
                    {
                      title: "پایگاه داده",
                      text: `مانند 'مغز' یک برنامه کاربردی است. پایگاه های داده برنامه
                  هایی هستند که برای سازماندهی و ذخیره تمامی دارایی ها، محتوا و
                  اطلاعات یک برنامه کاربردی به گونه ای که به راحتی قابل دسترسی و
                  بازیابی، مدیریت و به روز رسانی باشد، استفاده می شوند.`,
                    },
                  ]}
                  expand={expand}
                  setExpand={setExpand}
                  text={expand ? "بستن مطالب" : "ادامه مطالب"}
                  topics={{
                    line1: [
                      "HTML & CSS",
                      "JS",
                      "Node JS",
                      "Express",
                      "Mongodb",
                    ],
                  }}
                />
              </div>
            </div>
          )}

          {params.courseName === "accounting" && (
            <div>
              <div className="lg:grid lg:grid-cols-1 hidden">
                <InfoCard
                  title="دوره جامع حسابداری"
                  textInfo="حسابداری از جمله مشاغل ضروری هر کسب‌وکاری است. هر کسب‌وکاری بسته به حجم فعالیت، حداقل به یک حسابدار برای سروسامان بخشیدن امور مالی نیاز دارد. پس اگر شما در ابتدای مسیر انتخاب رشته و حرفه هستید و به حسابداری علاقه‌‌مندید؛ شک نداشته باشید که این حرفه آینده‌ شما را می‌سازد! همچنین اگر به دنبال تحقیق رشته حسابداری هستید در ادامه مطلب با ما همراه باشید."
                  imgSrc="/courses/accountingicon3.svg"
                />
                <div>
                  {/* texts */}
                  <InfoParagraphs
                    info={[
                      {
                        title: "حسابدار انبار",
                        text: `
                تمامی وظایفی که حسابدار انبار برعهده دارد در راستای دستیابی به
                موجودی کمی و وضعیت کیفی کالاها و کنترل دارایی موجود در انبار
                است. از جاییکه انبار و بررسی موجودی آن یکی از وظایف بسیار کلیدی
                در هر شرکتی است، معمولا با کمک یک حسابدار انبار می‌توان موجودی و
                نقطه سفارش کالاها را براحتی تحت مدیریت داشت.`,
                      },
                      {
                        title: "حسابدار مالیاتی",
                        text: `
                    حسابدار مالیاتی یکی از تخصص‌هایی است که به علت اهمیت موضوع
                    مالیات ایجاد شده است. در این شیوه کاری حسابدار به جای رسیدگی به
                    صورت‌های مالی مختلف تنها روی مبحث مالیات و حسابداری امور مالیاتی
                    تمرکز می‌کند. معمولا در این سمت از افراد باتجربه و باسابقه
                    استفاده می‌شود.`,
                      },
                      {
                        title: "حسابدار مالی",
                        text: `
                    در فرآیند حسابداری مالی تجزیه‌ و تحلیل معاملات تجاری و تهیه
                    صورت‌های مالی انجام می‌شود که سلامت مالی یک شرکت را نشان‌
                    می‌دهد. اما یک حسابدار مالی وظایفی مثل تهیه گزارش مالی، تهیه
                    گزارش سود و زیان، انجام ممیزی داخلی و تهیه صورت‌های هفتگی جریان
                    نقدی و کنترل مخارج و جریان نقدی را برعهده دارد.`,
                      },
                    ]}
                    expand={expand}
                  />
                  {/* button */}
                  <InfoBtn
                    text={expand ? "بستن مطالب" : "ادامه مطالب"}
                    setExpand={setExpand}
                    expand={expand}
                  />
                  {/* Topics */}
                  <Topics
                    topics={{
                      line1: ["دفاتر نویسی", "مغایرت گیری", "ثبت صدور اسناد"],
                      line2: [
                        "اظهارنامه عملکرد",
                        "قوانین کار",
                        "تهیه لیست حقوق",
                      ],
                      line3: [
                        "تهیه لیست بیمه",
                        "اکسل در حسابدرای",
                        "سپیدار همکاران سیستم",
                      ],
                    }}
                  />
                  {/* teacher */}
                  <Teacher />
                </div>
              </div>
              <div className="lg:hidden grid grid-cols-1">
                <MainComponent
                  imgSrc="/courses/accountingicon3.svg"
                  info={[
                    {
                      title: "حسابدار انبار",
                      text: `
              تمامی وظایفی که حسابدار انبار برعهده دارد در راستای دستیابی به
              موجودی کمی و وضعیت کیفی کالاها و کنترل دارایی موجود در انبار
              است. از جاییکه انبار و بررسی موجودی آن یکی از وظایف بسیار کلیدی
              در هر شرکتی است، معمولا با کمک یک حسابدار انبار می‌توان موجودی و
              نقطه سفارش کالاها را براحتی تحت مدیریت داشت.`,
                    },
                    {
                      title: "حسابدار مالیاتی",
                      text: `
                  حسابدار مالیاتی یکی از تخصص‌هایی است که به علت اهمیت موضوع
                  مالیات ایجاد شده است. در این شیوه کاری حسابدار به جای رسیدگی به
                  صورت‌های مالی مختلف تنها روی مبحث مالیات و حسابداری امور مالیاتی
                  تمرکز می‌کند. معمولا در این سمت از افراد باتجربه و باسابقه
                  استفاده می‌شود.`,
                    },
                    {
                      title: "حسابدار مالی",
                      text: `
                  در فرآیند حسابداری مالی تجزیه‌ و تحلیل معاملات تجاری و تهیه
                  صورت‌های مالی انجام می‌شود که سلامت مالی یک شرکت را نشان‌
                  می‌دهد. اما یک حسابدار مالی وظایفی مثل تهیه گزارش مالی، تهیه
                  گزارش سود و زیان، انجام ممیزی داخلی و تهیه صورت‌های هفتگی جریان
                  نقدی و کنترل مخارج و جریان نقدی را برعهده دارد.`,
                    },
                  ]}
                  expand={expand}
                  setExpand={setExpand}
                  text={expand ? "بستن مطالب" : "ادامه مطالب"}
                  title="دوره جامع حسابداری"
                  textInfo="حسابداری از جمله مشاغل ضروری هر کسب‌وکاری است. هر کسب‌وکاری بسته به حجم فعالیت، حداقل به یک حسابدار برای سروسامان بخشیدن امور مالی نیاز دارد. پس اگر شما در ابتدای مسیر انتخاب رشته و حرفه هستید و به حسابداری علاقه‌‌مندید؛ شک نداشته باشید که این حرفه آینده‌ شما را می‌سازد! همچنین اگر به دنبال تحقیق رشته حسابداری هستید در ادامه مطلب با ما همراه باشید."
                  topics={{
                    line1: ["دفاتر نویسی", "مغایرت گیری", "ثبت صدور اسناد"],
                    line2: ["اظهارنامه عملکرد", "قوانین کار", "تهیه لیست حقوق"],
                    line3: [
                      "تهیه لیست بیمه",
                      "اکسل در حسابدرای",
                      "سپیدار همکاران سیستم",
                    ],
                  }}
                />
              </div>
            </div>
          )}

          {params.courseName === "digital-marketing" && (
            <div>
              <div className="lg:grid lg:grid-cols-1 hidden">
                <InfoCard
                  title="دوره جامع دیجیتال مارکتینگ"
                  textInfo="دیجیتال مارکتینگ عملی است برای تبلیغ محصولات یا خدمات با کمک دستگاه ها و فناوری های دیجیتال.
              به زبان ساده، دیجیتال مارکتینگ به هر شکلی از بازاریابی گفته می شود که به صورت آنلاین با کمک موبایل، لپ تاپ، اینترنت و غیره انجام می شود، علاوه بر نشانه گذاری دیجیتال و فناوری که ممکن است به اینترنت متصل نباشد. می تواند شامل هر چیز پیچیده مانند ابتکارات بازاریابی ایمیل خودکار گرفته تا انتخاب محتوای وبلاگ وب سایت شما شود."
                  imgSrc="/courses/digitalmarketing4.svg"
                />
                <div>
                  {/* texts */}
                  {/* text one */}
                  <InfoParagraphs
                    info={[
                      {
                        title: "چرا بازاریابی دیجیتال مهم است؟",
                        text: `
                طیف وسیعی از کاربران اینترنت که زمان و پول خود را به صورت
                آنلاین خرج می کنند در برمیگیرد. کسب‌وکارهای کوچک را در
                موقعیت‌های برتر نسبت به شرکت‌های با بودجه تبلیغاتی ناچیز قرار
                می‌دهد.تمرکز را برای کسب و کارها فراهم می کند تا اطمینان حاصل
                شود که مخاطبان هدف پیام های آنها را می خوانند. به بازاریابی در
                سطح شخصی اجازه می دهد تا راحتی و امنیت را برای مشتریان فراهم کند
                تا در پیام ها مشترک شوند و خرید کنند.ردیابی تبلیغات و برقراری
                ارتباط با مخاطبان هدف را قادر می سازد.مقیاس و سازگاری را برای
                کسب و کارهای در حال رشد فراهم می کند تا نتایج آنی به دست آورند و
                بر این اساس بهینه سازی کنند و درآمدهای از دست رفته و هزینه های
                تبلیغاتی هدر رفته را کاهش دهد.بر تصمیمات خرید کاربران اینترنتی
                که به دنبال خدمات، محصولات یا هر چیزی که به صورت آنلاین تمایل
                دارند، تأثیر می گذارد. به کسب و کارها اجازه می دهد تا با
                ابزارهای مختلفی که نشان دهنده احترام فردی است، برای مردم
                بازاریابی کنند.`,
                      },
                      {
                        title: "مزایای دیجیتال مارکتینگ",
                        text: `
                    دیجیتال مارکتینگ در مدت کوتاهی بسیار محبوب شده است و دلیل خوبی
                    هم دارد. امروزه مشتریان زمان زیادی را به صورت آنلاین سپری می
                    کنند و انتظار دارند شرکت های مورد علاقه آنها نیز آنلاین
                    باشند.چشم انداز اینترنت ممکن است ترسناک به نظر برسد، اما
                    بازاریابی دیجیتال موثر می تواند یک موهبت بزرگ برای تجارت باشد.
                    با استراتژی و اجرای دقیق، مزایای بازاریابی دیجیتال در تجارت شامل
                    گسترش مخاطبان، ملاقات با مشتریان هدف در جایی که وقت خود را سپری
                    می کنند، و دستیابی به این امر با قیمتی بسیار مقرون به صرفه تر از
                    روش های بازاریابی سنتی است.به همین دلیل، بیش از 60 درصد از
                    بازاریابان تمرکز خود را از بازاریابی سنتی به دیجیتال منتقل کرده
                    اند`,
                      },
                    ]}
                    expand={expand}
                  />
                  {/* button */}
                  <InfoBtn
                    text={expand ? "بستن مطالب" : "ادامه مطالب"}
                    setExpand={setExpand}
                    expand={expand}
                  />
                  {/* Topics */}
                  <Topics
                    topics={{
                      line1: [
                        "HTML & CSS",
                        "Sass",
                        "Tailwind",
                        "React JS",
                        "Next JS",
                      ],
                    }}
                  />
                  {/* teacher */}
                  <Teacher />
                </div>
              </div>
              <div className="lg:hidden grid grid-cols-1">
                <MainComponent
                  imgSrc="/courses/digitalmarketing4.svg"
                  info={[
                    {
                      title: "چرا بازاریابی دیجیتال مهم است؟",
                      text: `
              طیف وسیعی از کاربران اینترنت که زمان و پول خود را به صورت
              آنلاین خرج می کنند در برمیگیرد. کسب‌وکارهای کوچک را در
              موقعیت‌های برتر نسبت به شرکت‌های با بودجه تبلیغاتی ناچیز قرار
              می‌دهد.تمرکز را برای کسب و کارها فراهم می کند تا اطمینان حاصل
              شود که مخاطبان هدف پیام های آنها را می خوانند. به بازاریابی در
              سطح شخصی اجازه می دهد تا راحتی و امنیت را برای مشتریان فراهم کند
              تا در پیام ها مشترک شوند و خرید کنند.ردیابی تبلیغات و برقراری
              ارتباط با مخاطبان هدف را قادر می سازد.مقیاس و سازگاری را برای
              کسب و کارهای در حال رشد فراهم می کند تا نتایج آنی به دست آورند و
              بر این اساس بهینه سازی کنند و درآمدهای از دست رفته و هزینه های
              تبلیغاتی هدر رفته را کاهش دهد.بر تصمیمات خرید کاربران اینترنتی
              که به دنبال خدمات، محصولات یا هر چیزی که به صورت آنلاین تمایل
              دارند، تأثیر می گذارد. به کسب و کارها اجازه می دهد تا با
              ابزارهای مختلفی که نشان دهنده احترام فردی است، برای مردم
              بازاریابی کنند.`,
                    },
                    {
                      title: "مزایای دیجیتال مارکتینگ",
                      text: `
                  دیجیتال مارکتینگ در مدت کوتاهی بسیار محبوب شده است و دلیل خوبی
                  هم دارد. امروزه مشتریان زمان زیادی را به صورت آنلاین سپری می
                  کنند و انتظار دارند شرکت های مورد علاقه آنها نیز آنلاین
                  باشند.چشم انداز اینترنت ممکن است ترسناک به نظر برسد، اما
                  بازاریابی دیجیتال موثر می تواند یک موهبت بزرگ برای تجارت باشد.
                  با استراتژی و اجرای دقیق، مزایای بازاریابی دیجیتال در تجارت شامل
                  گسترش مخاطبان، ملاقات با مشتریان هدف در جایی که وقت خود را سپری
                  می کنند، و دستیابی به این امر با قیمتی بسیار مقرون به صرفه تر از
                  روش های بازاریابی سنتی است.به همین دلیل، بیش از 60 درصد از
                  بازاریابان تمرکز خود را از بازاریابی سنتی به دیجیتال منتقل کرده
                  اند`,
                    },
                  ]}
                  expand={expand}
                  setExpand={setExpand}
                  text={expand ? "بستن مطالب" : "ادامه مطالب"}
                  title="دوره جامع دیجیتال مارکتینگ"
                  textInfo="دیجیتال مارکتینگ عملی است برای تبلیغ محصولات یا خدمات با کمک دستگاه ها و فناوری های دیجیتال.
              به زبان ساده، دیجیتال مارکتینگ به هر شکلی از بازاریابی گفته می شود که به صورت آنلاین با کمک موبایل، لپ تاپ، اینترنت و غیره انجام می شود، علاوه بر نشانه گذاری دیجیتال و فناوری که ممکن است به اینترنت متصل نباشد. می تواند شامل هر چیز پیچیده مانند ابتکارات بازاریابی ایمیل خودکار گرفته تا انتخاب محتوای وبلاگ وب سایت شما شود."
                  topics={{
                    line1: [
                      "HTML & CSS",
                      "Sass",
                      "Tailwind",
                      "React JS",
                      "Next JS",
                    ],
                  }}
                />
              </div>
            </div>
          )}

          {params.courseName === "ui-design" && (
            <div>
              <div className="lg:grid lg:grid-cols-1 hidden">
                <InfoCard
                  title="دوره جامع طراحی رابط کاربری"
                  textInfo=" طراحان رابط کاربری دانش فنی، عناصر طراحی و خلاقیت را برای توسعه و ادغام طراحی های وب سایت جذاب و واکنش گرا به کار می گیرند. مهارت های آنها شامل مهارت های سخت و نرم است و بسیاری از طراحان رابط کاربری مهارت های خود را از طریق تجربه عملی توسعه می دهند. برای موفقیت در طراحی رابط کاربری، توسعه مهارت های خود در زمینه های تخصصی مانند ابزارهای طراحی، نرم افزار طراحی رابط کاربری و طراحی گرافیک ضروری است. "
                  imgSrc="/courses/uxdesign.svg"
                />
                <div>
                  {/* texts */}
                  {/* text one */}
                  <InfoParagraphs
                    info={[
                      {
                        title: "",
                        text: "شما اول که وارد یک سایت می شوید چه چیزی به نظرتان می آید؟ اولین کاری که می کنید چیست؟ اصلا چه چیزی دقیقا توجه شما را جلب می کند؟ مسلما پاسخ به این پرسش ها با ورود به هر سایتی متفاوت است. به علاوه، سلیقه های افراد مختلف هم یکی نیست و هرکسی زمانی که وارد یک سایت می شود ممکن است انتظار متفاوتی نسبت به دیگری از آن سایت داشته باشد. فرقی نمی کند، مسلما شما وارد هر سایتی که بشوید دوست دارید طراحی قابل قبول(حداقل مرتب) و کارکرد درست را مشاهده بکنید. این دو چیز برای همه تقریبا یکسان است. همه کاربران دنیای دیجیتال از یک سایت انتظار داشتن رابط کاربری خوب و در حد قابل قبول را دارند. حالا این رابط کاربری اصلا چه چیزی هست؟ چه کارایی باید انجام بدیم که طراحی رابط کاربری خوب داشته باشیم؟",
                      },
                      {
                        title: "رابط کاربری یا همان UI چیست؟",
                        text: `
                  اول از همه بهتر است یک تعریف خوب و درست از UI یا همان رابط کاربری داشته باشیم. UI مخفف User Interface است که به فارسی همان معنای رابط کاربری را دارد. در واقع رابط کاربری مجموعه المان ها و مفاهیم در یک سایت را شامل می شود که کاربر آن ها را می بیند و این المان ها باعث می شوند کاربر بتواند فعالیتی در سایت انجام دهد. حال این فعالیت ها می توانند شامل کلیک کردن، تایپ کردن، مشاهده کردن و… باشد. در تعریف جزئی تر هم می توان گفت به مجموعه کارکرد ها و طراحی گرافیکی سایت رابط کاربری سایت می گویند. از همین تعریف می توان دریافت که چقدر این بخش در طراحی سایت مهم است. به طور کلی می توان گفت عمده کاری که در اصول طراحی سایت ( خود ذات طراحی سایت یا وب دیزاین نه موارد دیگر مربوط به سایت ) انجام می شود، طراحی رابط کاربری سایت است.`,
                      },
                    ]}
                    expand={expand}
                  />
                  {/* button */}
                  <InfoBtn
                    text={expand ? "بستن مطالب" : "ادامه مطالب"}
                    setExpand={setExpand}
                    expand={expand}
                  />
                  {/* Topics */}
                  <Topics
                    topics={{
                      line1: [
                        "HTML & CSS",
                        "Sass",
                        "Tailwind",
                        "React JS",
                        "Next JS",
                      ],
                    }}
                  />
                  {/* teacher */}
                  <Teacher />
                </div>
              </div>
              <div className="lg:hidden grid grid-cols-1">
                <MainComponent
                  imgSrc="/courses/uxdesign.svg"
                  info={[
                    {
                      title: "",
                      text: "شما اول که وارد یک سایت می شوید چه چیزی به نظرتان می آید؟ اولین کاری که می کنید چیست؟ اصلا چه چیزی دقیقا توجه شما را جلب می کند؟ مسلما پاسخ به این پرسش ها با ورود به هر سایتی متفاوت است. به علاوه، سلیقه های افراد مختلف هم یکی نیست و هرکسی زمانی که وارد یک سایت می شود ممکن است انتظار متفاوتی نسبت به دیگری از آن سایت داشته باشد. فرقی نمی کند، مسلما شما وارد هر سایتی که بشوید دوست دارید طراحی قابل قبول(حداقل مرتب) و کارکرد درست را مشاهده بکنید. این دو چیز برای همه تقریبا یکسان است. همه کاربران دنیای دیجیتال از یک سایت انتظار داشتن رابط کاربری خوب و در حد قابل قبول را دارند. حالا این رابط کاربری اصلا چه چیزی هست؟ چه کارایی باید انجام بدیم که طراحی رابط کاربری خوب داشته باشیم؟",
                    },
                    {
                      title: "رابط کاربری یا همان UI چیست؟",
                      text: `
                                  اول از همه بهتر است یک تعریف خوب و درست از UI یا همان رابط کاربری داشته باشیم. UI مخفف User Interface است که به فارسی همان معنای رابط کاربری را دارد. در واقع رابط کاربری مجموعه المان ها و مفاهیم در یک سایت را شامل می شود که کاربر آن ها را می بیند و این المان ها باعث می شوند کاربر بتواند فعالیتی در سایت انجام دهد. حال این فعالیت ها می توانند شامل کلیک کردن، تایپ کردن، مشاهده کردن و… باشد. در تعریف جزئی تر هم می توان گفت به مجموعه کارکرد ها و طراحی گرافیکی سایت رابط کاربری سایت می گویند. از همین تعریف می توان دریافت که چقدر این بخش در طراحی سایت مهم است. به طور کلی می توان گفت عمده کاری که در اصول طراحی سایت ( خود ذات طراحی سایت یا وب دیزاین نه موارد دیگر مربوط به سایت ) انجام می شود، طراحی رابط کاربری سایت است.`,
                    },
                  ]}
                  expand={expand}
                  setExpand={setExpand}
                  text={expand ? "بستن مطالب" : "ادامه مطالب"}
                  title="دوره جامع طراحی رابط کاربری"
                  textInfo=" طراحان رابط کاربری دانش فنی، عناصر طراحی و خلاقیت را برای توسعه و ادغام طراحی های وب سایت جذاب و واکنش گرا به کار می گیرند. مهارت های آنها شامل مهارت های سخت و نرم است و بسیاری از طراحان رابط کاربری مهارت های خود را از طریق تجربه عملی توسعه می دهند. برای موفقیت در طراحی رابط کاربری، توسعه مهارت های خود در زمینه های تخصصی مانند ابزارهای طراحی، نرم افزار طراحی رابط کاربری و طراحی گرافیک ضروری است. "
                  topics={{
                    line1: [
                      "HTML & CSS",
                      "Sass",
                      "Tailwind",
                      "React JS",
                      "Next JS",
                    ],
                  }}
                />
              </div>
            </div>
          )}
        </div>
      </div>
      <Footer />
    </div>
  );
};
export default CourseInfo;

/* texts
              // <p className="flex flex-row items-center gap-4 mt-16">
                // <span>
                  // <img src="/singlecourse/pointer.png" className="w-[20px]" />
                // </span>
                // <span className="font-semibold text-[30px]"></span>
              // </p>
              // <p className="text-[20px] font-normal px-7"></p> */
